share/tutorials/incompressible/dym-pimple/propeller/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.06;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            fixedValue;
    value           $internalField;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;
  }
  wall
  {
    type            kqRWallFunction;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
