share/tutorials/incompressible/dym-pimple/propeller/system/Q
// Calculate Q (from U)
Q
{
    // Where to load it from
    functionObjectLibs ("libmousse_utility_function_objects.so");

    type Q;

    // Output every
    outputControl outputTime;
}
