share/tutorials/incompressible/dym-pimple/propeller/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;
vertices
(
  (-0.3 -0.81 -0.3)
  ( 0.3 -0.81 -0.3)
  ( 0.3  0.21 -0.3)
  (-0.3  0.21 -0.3)
  (-0.3 -0.81  0.3)
  ( 0.3 -0.81  0.3)
  ( 0.3  0.21  0.3)
  (-0.3  0.21  0.3)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (12 20 12) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  walls
  {
    type wall;
    faces
    (
      (2 6 5 1)
      (0 3 2 1)
      (0 4 7 3)
      (4 5 6 7)
    );
  }
  inlet
  {
    type patch;
    faces
    (
      (3 7 6 2)
    );
  }
  outlet
  {
    type patch;
    faces
    (
      (1 5 4 0)
    );
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
