share/tutorials/incompressible/dym-pimple/propeller/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     dym-pimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.1;
deltaT          1e-5;
writeControl    adjustableRunTime;
writeInterval   0.001;
////- For testing with moveDynamicMesh
//deltaT          0.01;
//writeControl    timeStep;
//writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
writeCompression on;
timeFormat      general;
timePrecision   12;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           2;
functions
{
  #include "readFields"
  #include "Q"
  #include "surfaces"
  #include "forces"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
