share/tutorials/incompressible/dym-pimple/propeller/system/surfaces
surfaces
{
    type            surfaces;
    functionObjectLibs ("libmousse_sampling.so");
    outputControl   outputTime;

    surfaceFormat   vtk;
    fields          (p U Q);

    interpolationScheme cellPoint;

    surfaces
    (
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                basePoint       (0 0 0);
                normalVector    (0 0 1);
            }
            interpolate     true;
        }

        isoQ
        {
            type            isoSurface;
            isoField        Q;
            isoValue        1000;
            interpolate     true;
        }

        propeller
        {
            type            patch;
            patches         ("propeller.*");
            interpolate     true;
        }
    );
}
